#!/usr/bin/env python2
# -*- coding: utf-8 -*-
"""
Created on Tue May  9 14:44:47 2017
Sum amount for each city in blow list

서울,부산,대구,인천,광주,대전,울산,동두천,수원,양평,이천,파주,강릉,대관령,동해,
강릉,춘천,삼척,속초,영월,원주,인제,정선군,철원,태백,홍천,보은,제천,청주,추풍령,
충주,금산,보령,부여,서산,천안,고창,고창군,군산,남원,부안,순창군,임실,장수,전주,
정읍,강진군,고흥,광양시,목포,무안,보성군,순천,여수,영광군,완도,장흥,주암,진도군,
해남,흑산도,경주시,구미,문경,봉화,상주,안동,영덕,영주,영천,울릉도,울진,의성,청송군,
포항,거제,거창,김해시,남해,밀양,북창원,산청,양산시,의령군,진주,창원,통영,함양군,합천,
고산,서귀포,제주

@author: wanggengyu
"""
readfile = open("AmountByCityDay2016.txt")

cityList = ['서울','부산','대구','인천','광주','대전','울산','동두천','수원','양평','이천','파주','강릉','대관령','동해','강릉','춘천','삼척','속초','영월','원주','인제','정선군','철원','태백','홍천','보은','제천','청주','추풍령','충주','금산','보령','부여','서산','천안','고창','고창군','군산','남원','부안','순창군','임실','장수','전주','정읍','강진군','고흥','광양시','목포','무안','보성군','순천','여수','영광군','완도','장흥','주암','진도군','해남','흑산도','경주시','구미','문경','봉화','상주','안동','영덕','영주','영천','울릉도','울진','의성','청송군','포항','거제','거창','김해시','남해','밀양','북창원','산청','양산시','의령군','진주','창원','통영','함양군','합천','고산','서귀포','제주']
cityList2015 = ['서울','부산','대구','인천','광주','대전','동두천','수원','이천','파주','강릉','동해','춘천','삼척','원주','홍천','청주','고창군','군산','남원','부안','순창군','임실','장수','전주','정읍','강진군','고흥','광양시','목포','무안','보성군','순천','여수','영광군','완도','장흥','주암','진도군','해남','흑산도','경주시','구미','문경','봉화','상주','안동','영덕','영주','영천','울릉도','울진','의성','청송군','포항','거제','거창','김해시','남해','밀양','북창원','산청','양산시','의령군','진주','창원','통영','함양군','합천','고산','서귀포','제주']

sumQuantity = 0
sumCount = 0
date = ''
do = ''
si = ''

#for city in cityList:
city = '서울'
for date 
    for line in readfile.readlines():
        linelist = line.split()
        if linelist.empty():
            continue
        date = linelist[0] + linelist[1] + linelist[2]
        if date != 
        do = linelist[5]
        si = linelist[6]
        sumQuantity = int(linelist[7])
        sumCount = int(linelist[9])
        if city in do or city in si:
        